<details ><summary>apply for monitoring 2025-03-07 02:35:13 (UTC)</summary>
  <details ><summary>Apply output</summary>

```terraform
OpenTofu will perform the following actions:

  # cloudns_dns_record.grafana will be created
  + resource "cloudns_dns_record" "grafana" {
      + id    = (known after apply)
      + name  = (known after apply)
      + ttl   = 600
      + type  = "CNAME"
      + value = (known after apply)
      + zone  = "lumeportal.com"
    }

  # module.grafana.module.grafana_deployment.akash_deployment.service will be created
  + resource "akash_deployment" "service" {
      + deployment_dseq               = (known after apply)
      + deployment_gseq               = (known after apply)
      + deployment_oseq               = (known after apply)
      + deployment_owner              = (known after apply)
      + deployment_state              = (known after apply)
      + escrow_account_balance_amount = (known after apply)
      + escrow_account_balance_denom  = (known after apply)
      + escrow_account_owner          = (known after apply)
      + id                            = (known after apply)
      + last_updated                  = (known after apply)
      + provider_address              = (known after apply)
      + sdl                           = (sensitive value)
      + services                      = (known after apply)

      + provider_filters {
          + enforce   = true
          + providers = [
              + "akash1jukxttwauvnty679l720ey87ya5sgjv4j9tstn",
            ]
        }
    }

  # module.mysql.module.mysql_deployment.akash_deployment.service will be created
  + resource "akash_deployment" "service" {
      + deployment_dseq               = (known after apply)
      + deployment_gseq               = (known after apply)
      + deployment_oseq               = (known after apply)
      + deployment_owner              = (known after apply)
      + deployment_state              = (known after apply)
      + escrow_account_balance_amount = (known after apply)
      + escrow_account_balance_denom  = (known after apply)
      + escrow_account_owner          = (known after apply)
      + id                            = (known after apply)
      + last_updated                  = (known after apply)
      + provider_address              = (known after apply)
      + sdl                           = (sensitive value)
      + services                      = (known after apply)

      + provider_filters {
          + enforce   = true
          + providers = [
              + "akash1jukxttwauvnty679l720ey87ya5sgjv4j9tstn",
            ]
        }
    }

  # module.prometheus.module.prometheus_deployment.akash_deployment.service will be created
  + resource "akash_deployment" "service" {
      + deployment_dseq               = (known after apply)
      + deployment_gseq               = (known after apply)
      + deployment_oseq               = (known after apply)
      + deployment_owner              = (known after apply)
      + deployment_state              = (known after apply)
      + escrow_account_balance_amount = (known after apply)
      + escrow_account_balance_denom  = (known after apply)
      + escrow_account_owner          = (known after apply)
      + id                            = (known after apply)
      + last_updated                  = (known after apply)
      + provider_address              = (known after apply)
      + sdl                           = (sensitive value)
      + services                      = (known after apply)

      + provider_filters {
          + enforce   = true
          + providers = [
              + "akash1jukxttwauvnty679l720ey87ya5sgjv4j9tstn",
            ]
        }
    }

Plan: 4 to add, 0 to change, 0 to destroy.
module.prometheus.module.prometheus_deployment.akash_deployment.service: Creating...
module.mysql.module.mysql_deployment.akash_deployment.service: Creating...
module.prometheus.module.prometheus_deployment.akash_deployment.service: Still creating... [10s elapsed]
module.mysql.module.mysql_deployment.akash_deployment.service: Still creating... [10s elapsed]
module.prometheus.module.prometheus_deployment.akash_deployment.service: Still creating... [20s elapsed]
module.mysql.module.mysql_deployment.akash_deployment.service: Still creating... [20s elapsed]
module.prometheus.module.prometheus_deployment.akash_deployment.service: Creation complete after 29s [id=20528173:1:1:akash1vkzrwnzdfgguspdju4729t7g8k3yvd5nn6hs69:akash1jukxttwauvnty679l720ey87ya5sgjv4j9tstn]
module.mysql.module.mysql_deployment.akash_deployment.service: Still creating... [30s elapsed]
module.mysql.module.mysql_deployment.akash_deployment.service: Still creating... [40s elapsed]
module.mysql.module.mysql_deployment.akash_deployment.service: Still creating... [50s elapsed]
module.mysql.module.mysql_deployment.akash_deployment.service: Creation complete after 53s [id=20528175:1:1:akash1vkzrwnzdfgguspdju4729t7g8k3yvd5nn6hs69:akash1jukxttwauvnty679l720ey87ya5sgjv4j9tstn]
module.grafana.module.grafana_deployment.akash_deployment.service: Creating...
module.grafana.module.grafana_deployment.akash_deployment.service: Still creating... [10s elapsed]
module.grafana.module.grafana_deployment.akash_deployment.service: Still creating... [20s elapsed]
module.grafana.module.grafana_deployment.akash_deployment.service: Still creating... [30s elapsed]
module.grafana.module.grafana_deployment.akash_deployment.service: Creation complete after 36s [id=20528182:1:1:akash1vkzrwnzdfgguspdju4729t7g8k3yvd5nn6hs69:akash1jukxttwauvnty679l720ey87ya5sgjv4j9tstn]
cloudns_dns_record.grafana: Creating...
cloudns_dns_record.grafana: Creation complete after 0s [id=584531033]

Apply complete! Resources: 4 added, 0 changed, 0 destroyed.

```
</details>
</details>